const schedulesData = {
    "КН-41": {
        "faculty": "ФМФІТ",
        "date_range": "01.01.2026 - 01.07.2026",
        "schedule": [
            {
                "date": "02.02.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤092л1 Тестування та забезпечення якості ІТ проектів (Л)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤092л1",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤092л1 Тестування та забезпечення якості ІТ проектів (Л)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤092л1",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "03.02.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "04.02.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "05.02.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-41 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤014л2 Рекламний менеджмент (4 к.) (Л)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤014л2",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "06.02.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "09.02.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤092л1 Тестування та забезпечення якості ІТ проектів (Л)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤092л1",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "10.02.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤092л1 Тестування та забезпечення якості ІТ проектів (Л)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤092л1",
                        "details": "ауд. 232 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤0922 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0922",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.02.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤0922 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0922",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-41 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "12.02.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤092л1 Тестування та забезпечення якості ІТ проектів (Л)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤092л1",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-41 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "13.02.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "16.02.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "17.02.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0922 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0922",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤0922 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0922",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "18.02.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-41 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "19.02.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-41 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤014л2 Рекламний менеджмент (4 к.) (Л)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤014л2",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "20.02.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "23.02.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "24.02.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 232 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "25.02.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤0922 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0922",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-41 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "26.02.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0922 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0922",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-41 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤014л2 Рекламний менеджмент (4 к.) (Л)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤014л2",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤0143 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0143",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "27.02.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.03.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤275л1 Правознавство (4 к.) (Л)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤275л1",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "03.03.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "04.03.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-41 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-41 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "05.03.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-41 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤014л2 Рекламний менеджмент (4 к.) (Л)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤014л2",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤0143 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0143",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "06.03.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "09.03.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤275л1 Правознавство (4 к.) (Л)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤275л1",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "10.03.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 232 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.03.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤0922 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0922",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-41 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "12.03.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0922 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0922",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-41 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤014л2 Рекламний менеджмент (4 к.) (Л)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤014л2",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤0143 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0143",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "13.03.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "16.03.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤275л1 Правознавство (4 к.) (Л)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤275л1",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "17.03.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤2751 Правознавство (4 к.) (ПрС)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤2751",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "19.03.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤0143 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0143",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "23.03.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤275л1 Правознавство (4 к.) (Л)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤275л1",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "24.03.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤2751 Правознавство (4 к.) (ПрС)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤2751",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "26.03.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤0143 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0143",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "30.03.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤275л1 Правознавство (4 к.) (Л)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤275л1",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "31.03.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤2751 Правознавство (4 к.) (ПрС)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤2751",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.04.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤0143 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0143",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "07.04.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤2751 Правознавство (4 к.) (ПрС)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤2751",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "09.04.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤0143 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0143",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "13.04.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤011л1 Управління ризиком (Л)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤011л1",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "14.04.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤0111 Управління ризиком (ПрС)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤0111",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤2751 Правознавство (4 к.) (ПрС)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤2751",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "16.04.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤0143 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0143",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "20.04.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤011л1 Управління ризиком (Л)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤011л1",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "21.04.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤0111 Управління ризиком (ПрС)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤0111",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤2751 Правознавство (4 к.) (ПрС)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤2751",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "23.04.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤0143 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0143",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "27.04.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤011л1 Управління ризиком (Л)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤011л1",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "28.04.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0922 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0922",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤0111 Управління ризиком (ПрС)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤0111",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤2751 Правознавство (4 к.) (ПрС)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤2751",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "29.04.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "30.04.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤0143 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0143",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "01.05.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "04.05.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤011л1 Управління ризиком (Л)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤011л1",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "05.05.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0922 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0922",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤0111 Управління ризиком (ПрС)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤0111",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤2751 Правознавство (4 к.) (ПрС)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤2751",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "06.05.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-41 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41",
                        "details": "ауд. 324 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "07.05.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 316 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "08.05.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.05.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤011л1 Управління ризиком (Л)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤011л1",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "12.05.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤0111 Управління ризиком (ПрС)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤0111",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група В42¤0111 Управління ризиком (ПрС)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤0111",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤2751 Правознавство (4 к.) (ПрС)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤2751",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "13.05.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-41 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41",
                        "details": "ауд. 324 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "14.05.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "15.05.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-41 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "18.05.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤0111 Управління ризиком (ПрС)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤0111",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група В42¤0111 Управління ризиком (ПрС)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤0111",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "19.05.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤2751 Правознавство (4 к.) (ПрС)",
                        "teacher": "Остап`як М.М.",
                        "group": "В42¤2751",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "20.05.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "21.05.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 314 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "22.05.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤014л2 Рекламний менеджмент (4 к.) (КСР)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤014л2",
                        "details": "дист.",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "25.05.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤0111 Управління ризиком (ПрС)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤0111",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група В42¤0111 Управління ризиком (ПрС)",
                        "teacher": "Марцінків М.В.",
                        "group": "В42¤0111",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "26.05.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 403 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 403 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "27.05.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "28.05.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "КН-41 Теорія програмування... Письм.Екз.- за групу (КЕк)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41",
                        "details": "ауд. 403 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "29.05.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-41 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "01.06.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-41 Теорія програмування... Письм.Екз.- за групу (Екз)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.06.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-41 Практикум з програмування... Держ.Ат. Консультації (Л)",
                        "teacher": "Іляш Ю.Ю.",
                        "group": "КН-41",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            }
        ]
    },
    "КН-42": {
        "faculty": "ФМФІТ",
        "date_range": "01.01.2026 - 01.07.2026",
        "schedule": [
            {
                "date": "02.02.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤092л1 Тестування та забезпечення якості ІТ проектів (Л)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤092л1",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤092л1 Тестування та забезпечення якості ІТ проектів (Л)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤092л1",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "03.02.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "04.02.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "05.02.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤014л2 Рекламний менеджмент (4 к.) (Л)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤014л2",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "06.02.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "09.02.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤092л1 Тестування та забезпечення якості ІТ проектів (Л)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤092л1",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "10.02.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤092л1 Тестування та забезпечення якості ІТ проектів (Л)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤092л1",
                        "details": "ауд. 232 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.02.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "КН-42 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-42",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤252л1 Французька мова. Рівень А-2 (4 к.) (Л)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤252л1",
                        "details": "дист.",
                        "link": "https://us04web.zoom.us/j/*******080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    }
                ]
            },
            {
                "date": "12.02.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤092л1 Тестування та забезпечення якості ІТ проектів (Л)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤092л1",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-42 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "13.02.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "16.02.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "18.02.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "КН-42 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-42",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤252л1 Французька мова. Рівень А-2 (4 к.) (Л)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤252л1",
                        "details": "дист.",
                        "link": "https://zoom.us/j/6476900080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    }
                ]
            },
            {
                "date": "19.02.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-42 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤014л2 Рекламний менеджмент (4 к.) (Л)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤014л2",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "20.02.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0921 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0921",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "23.02.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "24.02.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 232 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "25.02.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "КН-42 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-42",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤252л1 Французька мова. Рівень А-2 (4 к.) (Л)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤252л1",
                        "details": "дист.",
                        "link": "https://zoom.us/j/6476900080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    }
                ]
            },
            {
                "date": "26.02.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-42 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤014л2 Рекламний менеджмент (4 к.) (Л)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤014л2",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "27.02.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0921 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0921",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.03.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "03.03.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "04.03.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "КН-42 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-42",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤252л1 Французька мова. Рівень А-2 (4 к.) (Л)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤252л1",
                        "details": "дист.",
                        "link": "https://zoom.us/j/6476900080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    }
                ]
            },
            {
                "date": "05.03.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-42 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤014л2 Рекламний менеджмент (4 к.) (Л)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤014л2",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "06.03.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0921 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0921",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "09.03.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "10.03.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 232 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.03.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-41, КН-42 Теорія програмування (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "КН-42 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-42",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤252л1 Французька мова. Рівень А-2 (4 к.) (Л)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤252л1",
                        "details": "дист.",
                        "link": "https://zoom.us/j/6476900080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤0144 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0144",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "12.03.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-41, КН-42 Історія української культури (Л)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-41, КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-42 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-42",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤014л2 Рекламний менеджмент (4 к.) (Л)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤014л2",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "13.03.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0921 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0921",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "18.03.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤0144 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0144",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "23.03.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група В42¤2521 Французька мова. Рівень А-2 (4 к.) (ПрС)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤2521",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "25.03.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤2521 Французька мова. Рівень А-2 (4 к.) (ПрС)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤2521",
                        "details": "дист.",
                        "link": "https://zoom.us/j/6476900080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤0144 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0144",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "01.04.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤0144 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0144",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "08.04.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤2521 Французька мова. Рівень А-2 (4 к.) (ПрС)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤2521",
                        "details": "дист.",
                        "link": "https://zoom.us/j/6476900080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤0144 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0144",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "15.04.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤2521 Французька мова. Рівень А-2 (4 к.) (ПрС)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤2521",
                        "details": "дист.",
                        "link": "https://zoom.us/j/6476900080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤0144 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0144",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "22.04.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤2521 Французька мова. Рівень А-2 (4 к.) (ПрС)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤2521",
                        "details": "дист.",
                        "link": "https://zoom.us/j/6476900080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤0144 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0144",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "27.04.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "28.04.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-42 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-42",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "29.04.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤2521 Французька мова. Рівень А-2 (4 к.) (ПрС)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤2521",
                        "details": "дист.",
                        "link": "https://zoom.us/j/6476900080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤0144 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0144",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "30.04.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-42 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-42",
                        "details": "ауд. 301 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "01.05.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0921 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0921",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "04.05.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "05.05.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-42 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-42",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "06.05.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤2521 Французька мова. Рівень А-2 (4 к.) (ПрС)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤2521",
                        "details": "дист.",
                        "link": "https://zoom.us/j/6476900080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤0144 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0144",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "07.05.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 316 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "КН-42 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-42",
                        "details": "ауд. 301 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "08.05.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0921 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0921",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.05.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "12.05.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "13.05.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤2521 Французька мова. Рівень А-2 (4 к.) (ПрС)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤2521",
                        "details": "дист.",
                        "link": "https://zoom.us/j/6476900080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група В42¤0144 Рекламний менеджмент (4 к.) (ПрС)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤0144",
                        "details": "дист.",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "14.05.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "КН-42 Історія української культури (Сем)",
                        "teacher": "Новосад М.Г.",
                        "group": "КН-42",
                        "details": "ауд. 301 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "15.05.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0921 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0921",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "18.05.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "19.05.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "20.05.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤2521 Французька мова. Рівень А-2 (4 к.) (ПрС)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤2521",
                        "details": "дист.",
                        "link": "https://zoom.us/j/6476900080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    }
                ]
            },
            {
                "date": "21.05.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб30 Розробка WEB-додатків (TypeScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб30",
                        "details": "ауд. 314 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб32 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб32",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "22.05.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0921 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0921",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤193л1 Програмування Mac iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤193л1",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤1931 Програмування Mac iOS (ПрС)",
                        "teacher": "Ровінський В.А.",
                        "group": "В42¤1931",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤014л2 Рекламний менеджмент (4 к.) (КСР)",
                        "teacher": "Шотурма Н.В.",
                        "group": "В42¤014л2",
                        "details": "дист.",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": "https://us05web.zoom.us/j/6025787563?pwd=c0RPUmtnUDVhSFYyWjlzRUlqdjBzQT09"
                    }
                ]
            },
            {
                "date": "25.05.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-42 Теорія програмування (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-42",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "26.05.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 403 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб22 Проектування систем глибинного навчання (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб22",
                        "details": "ауд. 403 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "27.05.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤2521 Французька мова. Рівень А-2 (4 к.) (ПрС)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤2521",
                        "details": "дист.",
                        "link": "https://zoom.us/j/6476900080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    }
                ]
            },
            {
                "date": "28.05.2026",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб31 Розробка WEB-додатків (TypeScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб31",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група В42¤0921 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0921",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "29.05.2026",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група В42¤0921 Тестування та забезпечення якості ІТ проектів (ПрС)",
                        "teacher": "Петришин М.Л.",
                        "group": "В42¤0921",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "КН-42 Теорія програмування... Письм.Екз.- за групу (КЕк)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-42",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "01.06.2026",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-42 Практикум з програмування... Держ.Ат. Консультації (Л)",
                        "teacher": "Іляш Ю.Ю.",
                        "group": "КН-42",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб25 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб25",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.06.2026",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-42 Теорія програмування... Письм.Екз.- за групу (Екз)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-42",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН-зб24 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб24",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН-зб23 Проектування систем глибинного навчання (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-зб23",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "03.06.2026",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група В42¤252л1 Французька мова. Рівень А-2 (4 к.) (КСР)",
                        "teacher": "Фенюк Л.Б.",
                        "group": "В42¤252л1",
                        "details": "дист.",
                        "link": "https://us04web.zoom.us/j/*******080?pwd=M0RYWEo4ekxJMTZLRWs5eDBZaTlFZz09"
                    }
                ]
            }
        ]
    }
};
